In [97]:
## Q No.1 :
import pandas as pd

In [2]:
df=pd.read_csv("taxonomy.csv")

In [3]:
df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

In [6]:
df.tail()

    taxonomy_id                          name parent_id           parent_name
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290 entries, 0 to 289
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   taxonomy_id  290 non-null    object
 1   name         290 non-null    object
 2   parent_id    279 non-null    object
 3   parent_name  279 non-null    object
dtypes: object(4)
memory usage: 9.2+ KB

In [8]:
df.describe()

       taxonomy_id          name  parent_id       parent_name
count          290           290        279               279
unique         290           183         60                50
top            101  Nursing Home  106-06-07  Health Education
freq             1             4         11                15

In [9]:
df.shape

(290, 4)

In [11]:
df.isnull().sum()

taxonomy_id     0
name            0
parent_id      11
parent_name    11
dtype: int64

In [4]:
## Q No.2 :
df = pd.DataFrame({"A" :[1,2,3,4,5],
             "B" :['sudh','kumar','krish','naik','pwskills'],
              "C" :[11,22,33,44,55]})
df.reindex(index=[1,3,5,7,9])

     A      B     C
1  2.0  kumar  22.0
3  4.0   naik  44.0
5  NaN    NaN   NaN
7  NaN    NaN   NaN
9  NaN    NaN   NaN

In [157]:
## Q No. 3 :
import pandas as pd
def calculate_sum(df):
    values = df['Values'].values
    sum_first_three = sum(values[:3])
    print("Sum of the first three values:", sum_first_three)
    
# Assuming the 'Values' column of the DataFrame contains [10, 20, 30, 40, 50]
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
calculate_sum(df)

Sum of the first three values: 60

In [20]:
## Q No. 4 :
df2=pd.DataFrame({"Text" :["sudh",'kumar','krish',"naik"]})
df2

    Text
0   sudh
1  kumar
2  krish
3   naik

In [21]:
df2["Word_Count"] =df2["Text"].apply(len)

In [22]:
df2

    Text  Word_Count
0   sudh           4
1  kumar           5
2  krish           5
3   naik           4

In [25]:
## Q No. 5 :
"""
Pandas DataFrame size()
The size property is used to get an int representing the number of elements in this object and
Return the number of rows if Series. 
Otherwise, return the number of rows times the number of columns if DataFrame.

Pandas DataFrame shape()
The shape property is used to get a tuple representing the dimensionality of the Pandas DataFrame.
"""
df2.size,df2.shape

(8, (4, 2))

In [26]:
## Q No. 6 :
# We can use the pandas module read_excel() function to read theexcel file data into a DataFrame object.

In [29]:
## Q No. 7 :
df3=pd.DataFrame({"Email" :["sudhkumar@gmail.com","krish@gmail.com",'naik@gnail.com',"fighter@gmail.com"]})
df3

                 Email
0  sudhkumar@gmail.com
1      krish@gmail.com
2       naik@gnail.com
3    fighter@gmail.com

In [39]:
df3["Username"] = df3['Email'].str.split('@').str[0]
df3

                 Email   Username
0  sudhkumar@gmail.com  sudhkumar
1      krish@gmail.com      krish
2       naik@gnail.com       naik
3    fighter@gmail.com    fighter

In [60]:
## Q No. 8 :
df4=pd.DataFrame({'A' :[10,22,6,4,57,1],
             "B" :[1,12,8,4,5,61],
             'C' :[11,222,33,44,55,1]})
df4

    A   B    C
0  10   1   11
1  22  12  222
2   6   8   33
3   4   4   44
4  57   5   55
5   1  61    1

In [88]:
df5=df4.loc[df4["A"] > 5]
df5=df5.loc[df4["B"] <10]
df5

    A  B   C
0  10  1  11
2   6  8  33
4  57  5  55

In [90]:
## Q No. 9 :
df=pd.DataFrame({"Values" :[10,20,30,40,50]})
df

   Values
0      10
1      20
2      30
3      40
4      50

In [92]:
df.mean()

Values    30.0
dtype: float64

In [94]:
df.median()

Values    30.0
dtype: float64

In [95]:
df.std()

Values    15.811388
dtype: float64

In [110]:
## Q No. 10 :
date=pd.date_range(start='06-06-23',end='16-06-23')
df=pd.DataFrame({"Sales" :[100,121,798,89,76,74,32,3,21,10,11],"dates" :date})
df

    Sales      dates
0     100 2023-06-06
1     121 2023-06-07
2     798 2023-06-08
3      89 2023-06-09
4      76 2023-06-10
5      74 2023-06-11
6      32 2023-06-12
7       3 2023-06-13
8      21 2023-06-14
9      10 2023-06-15
10     11 2023-06-16

In [111]:
df['Sales'].rolling(window=7).mean()

0            NaN
1            NaN
2            NaN
3            NaN
4            NaN
5            NaN
6     184.285714
7     170.428571
8     156.142857
9      43.571429
10     32.428571
Name: Sales, dtype: float64

In [120]:
## Q No. 11 :
dates=pd.date_range(start='16-06-23',end='22-06-23')
df=pd.DataFrame({"Date" : dates})
df

        Date
0 2023-06-16
1 2023-06-17
2 2023-06-18
3 2023-06-19
4 2023-06-20
5 2023-06-21
6 2023-06-22

In [126]:
df['Weekday']=["Monday","Tuesday",'Wednesday','Thursday','Friday','Saturday',"Sunday"]
df

        Date    Weekday
0 2023-06-16     Monday
1 2023-06-17    Tuesday
2 2023-06-18  Wednesday
3 2023-06-19   Thursday
4 2023-06-20     Friday
5 2023-06-21   Saturday
6 2023-06-22     Sunday

In [138]:
## Q No. 12 :
import numpy as np
import pandas as pd

df = pd.DataFrame(np.random.random((200,3)))
df['date'] = pd.date_range('01-01-2023', periods=200, freq='D')
mask = (df['date'] >= '01-01-2023') & (df['date'] <= '31-01-2023')
print(df.loc[mask])

           0         1         2       date
0   0.293424  0.589690  0.055944 2023-01-01
1   0.128282  0.492034  0.015143 2023-01-02
2   0.828646  0.166775  0.049405 2023-01-03
3   0.504930  0.670263  0.161973 2023-01-04
4   0.381546  0.119075  0.773590 2023-01-05
5   0.762430  0.222430  0.265833 2023-01-06
6   0.014224  0.839334  0.781975 2023-01-07
7   0.588936  0.412966  0.499831 2023-01-08
8   0.273252  0.906276  0.189172 2023-01-09
9   0.677901  0.532707  0.490653 2023-01-10
10  0.943908  0.233491  0.736168 2023-01-11
11  0.785681  0.744458  0.059267 2023-01-12
12  0.281275  0.419560  0.086247 2023-01-13
13  0.701210  0.106297  0.796086 2023-01-14
14  0.345704  0.952740  0.966229 2023-01-15
15  0.834193  0.730250  0.519898 2023-01-16
16  0.781679  0.194721  0.984335 2023-01-17
17  0.761276  0.730764  0.394463 2023-01-18
18  0.055764  0.986632  0.298960 2023-01-19
19  0.829453  0.113619  0.304318 2023-01-20
20  0.657948  0.449660  0.912140 2023-01-21
21  0.440057  0.044570  0.464927 2023-01-22
22  0.093422  0.607353  0.746649 2023-01-23
23  0.426687  0.550084  0.087347 2023-01-24
24  0.037737  0.211234  0.499716 2023-01-25
25  0.134809  0.439058  0.578430 2023-01-26
26  0.735948  0.666835  0.132730 2023-01-27
27  0.424447  0.475670  0.331345 2023-01-28
28  0.581544  0.992290  0.382080 2023-01-29
29  0.245217  0.526502  0.620145 2023-01-30
30  0.409645  0.151202  0.734854 2023-01-31

/tmp/ipykernel_84/618998397.py:7: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  mask = (df['date'] >= '01-01-2023') & (df['date'] <= '31-01-2023')

In [140]:
## Q No. 13:
'''
Installing and Getting Started with Pandas
importing pandas
As Pandas is dependent on the NumPy library, we need to import this dependency.
'''

'\nInstalling and Getting Started with Pandas\nimporting pandas\nAs Pandas is dependent on the NumPy library, we need to import this dependency.\n'